<?php

namespace Faker\Provider\uk_UA;

class Color extends \Faker\Provider\Color
{
<<<<<<< HEAD
    protected static $safeColorNames = [
        'чорний', 'темно-бордовий', 'зелений', 'темно-синій', 'оливковий',
        'фіолетовий', 'помаранчевий', 'синій', 'червоний',
        'сірий', 'жовтий', 'блакитний', 'морська хвиля', 'білий'
    ];

    protected static $allColorNames = [
=======
    protected static $safeColorNames = array(
        'чорний', 'темно-бордовий', 'зелений', 'темно-синій', 'оливковий',
        'фіолетовий', 'помаранчевий', 'синій', 'червоний',
        'сірий', 'жовтий', 'блакитний', 'морська хвиля', 'білий'
    );

    protected static $allColorNames = array(
>>>>>>> ab78874abac341c06d6224c7b68289052444df61
        'Бурштиновий', 'Абрикосовий', 'Зелений армійський', 'Спаржевий', 'Амарантовий', 'Янтарний',
        'Ніжно-блакитний', 'Аметистовий', 'Матовий білий', 'Античний білий', 'Смарагдовий', 'Спаржа',
        'Захисний синій', 'Жовто-зелений', 'Сіра спаржа', 'Індиго', 'Лавандний', 'Хакі', 'Нефритовий',
        'Лайм', 'Гірчичний', 'Чорний', 'Малахітовий', 'Синій', 'Вода пляжа Бонді', 'Латуний', 'Пурпурний',
        'Орхідея', 'Блідо-брунатний', 'Зелена сосна', 'Гарбуз', 'Лазурний', 'Каштановий', 'Шоколадний', 'Умбра',
        'Кобальтовий', 'Кремовий', 'Циан', 'Іржавий', 'Фуксия', 'Шафрановий', 'Лляний', 'Золотий', 'Зелений',
        'Лимонний', 'Ліловий', 'Перський синій', 'Охра', 'Панг', 'Сливовий', 'Фіолетово-червоний', 'Сірий',
        'Багряний', 'Срібний', 'Болотний', 'Пшеничний', 'Пастельно-зелений', 'Умбра', 'Лососевий', 'Синя сталь'
<<<<<<< HEAD
    ];
=======
    );
>>>>>>> ab78874abac341c06d6224c7b68289052444df61
}
